### Pandas Manuipulation

In [379]:
import pandas as pd
import numpy as np
from numpy.random import randn as rn

In [16]:
np.random.seed(123)
matrix_data=rn(4,3)

In [17]:
row_label=['A','B','C','D']
column_label=['W','X','Y']

In [18]:
DF=pd.DataFrame(data=matrix_data,index=row_label,columns=column_label)

In [19]:
DF

          W         X         Y
A -1.085631  0.997345  0.282978
B -1.506295 -0.578600  1.651437
C -2.426679 -0.428913  1.265936
D -0.866740 -0.678886 -0.094709

In [23]:
# Extract data on column wise 
DF[['W','X']]

          W         X
A -1.085631  0.997345
B -1.506295 -0.578600
C -2.426679 -0.428913
D -0.866740 -0.678886

In [25]:
type(DF['W'])

pandas.core.series.Series

In [26]:
type(DF[['W','X']])

pandas.core.frame.DataFrame

In [27]:
# Extract data on rows wise
DF.loc['D']

W   -0.866740
X   -0.678886
Y   -0.094709
Name: D, dtype: float64

In [28]:
# Extract data through default indexs
DF.iloc[3]

W   -0.866740
X   -0.678886
Y   -0.094709
Name: D, dtype: float64

In [29]:
# Note : loc takes the index name whereas iloc takes defalut index like 0 1 2 3

In [30]:
row_label=[20,30,40,50]
column_label=['W','X','Y']
DF=pd.DataFrame(data=matrix_data,index=row_label,columns=column_label)

In [31]:
DF

           W         X         Y
20 -1.085631  0.997345  0.282978
30 -1.506295 -0.578600  1.651437
40 -2.426679 -0.428913  1.265936
50 -0.866740 -0.678886 -0.094709

In [35]:
DF.loc[20]

W   -1.085631
X    0.997345
Y    0.282978
Name: 20, dtype: float64

In [36]:
DF.iloc[1]

W   -1.506295
X   -0.578600
Y    1.651437
Name: 30, dtype: float64

In [42]:
DF.iloc[[0,1],[0,1]]

           W         X
20 -1.085631  0.997345
30 -1.506295 -0.578600

In [43]:
DF.iloc[[1,2],[1,2]]

           X         Y
30 -0.578600  1.651437
40 -0.428913  1.265936

In [45]:
row_label=[20,20,40,50]
column_label=['W','X','Y']
DF=pd.DataFrame(data=matrix_data,index=row_label,columns=column_label)

In [46]:
DF

           W         X         Y
20 -1.085631  0.997345  0.282978
20 -1.506295 -0.578600  1.651437
40 -2.426679 -0.428913  1.265936
50 -0.866740 -0.678886 -0.094709

In [47]:
#Note custome index can be duplicate but default index can't be duplicate

In [52]:
DF.loc[[20,50]]

           W         X         Y
20 -1.085631  0.997345  0.282978
20 -1.506295 -0.578600  1.651437
50 -0.866740 -0.678886 -0.094709

In [54]:
DF.loc[[20,50],['W','Y']]

           W         Y
20 -1.085631  0.282978
20 -1.506295  1.651437
50 -0.866740 -0.094709

In [53]:
DF.iloc[[0,3],[0,1]]

           W         X
20 -1.085631  0.997345
50 -0.866740 -0.678886

In [56]:
DF.iloc[[0,3],[0,2]]

           W         Y
20 -1.085631  0.282978
50 -0.866740 -0.094709

In [58]:
DF.iloc[[0,-1],[0,-1]] # -1 is use for backward selection

           W         Y
20 -1.085631  0.282978
50 -0.866740 -0.094709

In [44]:
# iloc[row,column]

In [59]:
np.random.seed(121)
mat=np.random.randn(6,5)

In [69]:
mat_columns=['A','B','C','D','E']
mat_rows=[101,102,103,104,105,106]

mat_df=pd.DataFrame(data=mat,columns=mat_columns,index=mat_rows)
mat_df

            A         B         C         D         E
101 -0.212033 -0.284929 -0.573898 -0.440310 -0.330111
102  1.183695  1.615373  0.367062 -0.014119  0.629642
103  1.709641 -1.326987  0.401873 -0.191427  1.403826
104 -1.968769 -0.790415 -0.732722  0.087744 -0.500286
105  0.504114  0.607406  1.166450  0.824424 -3.086725
106  1.164342  1.082652  0.485796 -1.234884 -1.858882

In [62]:
# Requirment is to extract data from 102 to 105 index and include columns from A to C without using every column name

In [64]:
mat_df.loc[[102,103,104,105],['A','B','C']]

            A         B         C
102  1.183695  1.615373  0.367062
103  1.709641 -1.326987  0.401873
104 -1.968769 -0.790415 -0.732722
105  0.504114  0.607406  1.166450

In [67]:
mat_df.loc[102:105,'A':'C']

            A         B         C
102  1.183695  1.615373  0.367062
103  1.709641 -1.326987  0.401873
104 -1.968769 -0.790415 -0.732722
105  0.504114  0.607406  1.166450

In [66]:
mat_df.iloc[1:4,0:3]

            A         B         C
102  1.183695  1.615373  0.367062
103  1.709641 -1.326987  0.401873
104 -1.968769 -0.790415 -0.732722

In [71]:
# Create new columns from existing data

mat_df['A_sum_B']=mat_df['A']+mat_df['B']
mat_df.head(2)

            A         B         C         D         E   A_sum_B
101 -0.212033 -0.284929 -0.573898 -0.440310 -0.330111 -0.496962
102  1.183695  1.615373  0.367062 -0.014119  0.629642  2.799067

In [72]:
# Dropping of columns and row

In [73]:
mat_df.drop('A_sum_B',axis=1) # Axis 1 means dropping column

            A         B         C         D         E
101 -0.212033 -0.284929 -0.573898 -0.440310 -0.330111
102  1.183695  1.615373  0.367062 -0.014119  0.629642
103  1.709641 -1.326987  0.401873 -0.191427  1.403826
104 -1.968769 -0.790415 -0.732722  0.087744 -0.500286
105  0.504114  0.607406  1.166450  0.824424 -3.086725
106  1.164342  1.082652  0.485796 -1.234884 -1.858882

In [76]:
mat_df.drop(101,axis=0) # Axis =0 means dropping row

            A         B         C         D         E   A_sum_B
102  1.183695  1.615373  0.367062 -0.014119  0.629642  2.799067
103  1.709641 -1.326987  0.401873 -0.191427  1.403826  0.382653
104 -1.968769 -0.790415 -0.732722  0.087744 -0.500286 -2.759184
105  0.504114  0.607406  1.166450  0.824424 -3.086725  1.111521
106  1.164342  1.082652  0.485796 -1.234884 -1.858882  2.246994

In [77]:
# To drop data permanetly  need to add inplace =True also.

In [84]:
print('The DataFrame\n','-'*70)
print(mat_df)

The DataFrame
 ----------------------------------------------------------------------
            A         B         C         D         E   A_sum_B
101 -0.212033 -0.284929 -0.573898 -0.440310 -0.330111 -0.496962
102  1.183695  1.615373  0.367062 -0.014119  0.629642  2.799067
103  1.709641 -1.326987  0.401873 -0.191427  1.403826  0.382653
104 -1.968769 -0.790415 -0.732722  0.087744 -0.500286 -2.759184
105  0.504114  0.607406  1.166450  0.824424 -3.086725  1.111521
106  1.164342  1.082652  0.485796 -1.234884 -1.858882  2.246994

In [85]:
print('-'*20,'Conditional Filter','-'*20)

-------------------- Conditional Filter --------------------

In [86]:
print(mat_df>0)

         A      B      C      D      E  A_sum_B
101  False  False  False  False  False    False
102   True   True   True  False   True     True
103   True  False   True  False   True     True
104  False  False  False   True  False    False
105   True   True   True   True  False     True
106   True   True   True  False  False     True

In [92]:
mat_df[mat_df.loc[:,['A','B','C']]>0]

            A         B         C   D   E  A_sum_B
101       NaN       NaN       NaN NaN NaN      NaN
102  1.183695  1.615373  0.367062 NaN NaN      NaN
103  1.709641       NaN  0.401873 NaN NaN      NaN
104       NaN       NaN       NaN NaN NaN      NaN
105  0.504114  0.607406  1.166450 NaN NaN      NaN
106  1.164342  1.082652  0.485796 NaN NaN      NaN

In [3]:
dic={
'Age':[20,30,40,45,60,55,76],
'Height':[5.3,4.4,6,7,3.3,5.5,4.5],
'Weight':[45,33,55,70,110,350,65]
}

In [9]:
df=pd.DataFrame(dic,index=range(7),columns=dic.keys())
df

   Age  Height  Weight
0   20     5.3      45
1   30     4.4      33
2   40     6.0      55
3   45     7.0      70
4   60     3.3     110
5   55     5.5     350
6   76     4.5      65

In [10]:
# filter the data where age>30 , height >5 ,weight>50
# Through loc
df.loc[(df['Age']>30) & (df['Height']>5) & (df['Weight']>60)]

   Age  Height  Weight
3   45     7.0      70
5   55     5.5     350

In [13]:
# Through dataframe[]
df[(df['Age']>30) & (df['Height']>5) & (df['Weight']>60)]

   Age  Height  Weight
3   45     7.0      70
5   55     5.5     350

In [14]:
# with the help of reset_index we get dataframe into default indexes

In [17]:
df.reset_index(drop=True)

   Age  Height  Weight
0   20     5.3      45
1   30     4.4      33
2   40     6.0      55
3   45     7.0      70
4   60     3.3     110
5   55     5.5     350
6   76     4.5      65

In [24]:
df['Name']="aman rahul sonali sonakshi arzo tarun rohit".split()
df.set_index('Name',inplace=True)

In [28]:
#Multi- Level Index

In [54]:
# Index Level
outside=['G1','G1','G1','G2','G2','G2']
inside=[1,2,1,2,3,4,5,7,8,9]
hier_index=list(zip(outside,inside))

In [55]:
hier_index

[('G1', 1), ('G1', 2), ('G1', 1), ('G2', 2), ('G2', 3), ('G2', 4)]

In [56]:
hier_index=pd.MultiIndex.from_tuples(hier_index)

In [57]:
print(hier_index)

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 1),
            ('G2', 2),
            ('G2', 3),
            ('G2', 4)],
           )

In [58]:
df1=pd.DataFrame(data=np.random.randn(6,3),index=hier_index,columns=['A','B','C'])
df1

             A         B         C
G1 1 -0.708216  1.041318  0.857331
   2  2.113658  0.145310  0.853906
   1 -0.884294 -0.522395  1.779875
G2 2  1.201378  0.788614 -1.379157
   3 -2.168066 -0.001153 -0.224584
   4 -0.721117  0.904986  0.218307

In [62]:
df1.loc['G1',1]['A']

C:\Users\Aman saini\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: PerformanceWarning: indexing past lexsort depth may impact performance.
  """Entry point for launching an IPython kernel.

G1  1   -0.708216
    1   -0.884294
Name: A, dtype: float64

In [67]:
df1.loc['G1',1]['C']

C:\Users\Aman saini\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: PerformanceWarning: indexing past lexsort depth may impact performance.
  """Entry point for launching an IPython kernel.

G1  1    0.857331
    1    1.779875
Name: C, dtype: float64

In [81]:
df1.loc['G2',4]

C:\Users\Aman saini\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: PerformanceWarning: indexing past lexsort depth may impact performance.
  """Entry point for launching an IPython kernel.

             A         B         C
G2 4 -0.721117  0.904986  0.218307

In [72]:
df1.iloc[0,1]

1.0413181182025755

In [84]:
df1.loc['G2'].loc[4,['B','C']]

B    0.904986
C    0.218307
Name: 4, dtype: float64

In [85]:
df1

             A         B         C
G1 1 -0.708216  1.041318  0.857331
   2  2.113658  0.145310  0.853906
   1 -0.884294 -0.522395  1.779875
G2 2  1.201378  0.788614 -1.379157
   3 -2.168066 -0.001153 -0.224584
   4 -0.721117  0.904986  0.218307

In [96]:
# Through loc
df1.loc['G2'].loc[4,'B':'C']

B    0.904986
C    0.218307
Name: 4, dtype: float64

In [100]:
# Through iloc
df1.iloc[5,1:3]

B    0.904986
C    0.218307
Name: (G2, 4), dtype: float64

In [119]:
# Question to create multi index from three list

L1=['A','A','A','B','B','B','C','C','C']
L2=[1,2,3,1,2,3,1,2,3]
L3=[1,2,3,4,5,6,7,8,9]

multi_ind=list(zip(L1,L2,L3))

In [129]:
multi_ind

[('A', 1, 1),
 ('A', 2, 2),
 ('A', 3, 3),
 ('B', 1, 4),
 ('B', 2, 5),
 ('B', 3, 6),
 ('C', 1, 7),
 ('C', 2, 8),
 ('C', 3, 9)]

In [120]:
df_index=pd.MultiIndex.from_tuples(multi_ind)

In [130]:
df=pd.DataFrame(data=np.round(rn(9,4)),index=df_index)

In [131]:
df

         0    1    2    3
A 1 1  0.0 -2.0 -0.0  0.0
  2 2 -1.0 -1.0 -0.0  0.0
  3 3 -0.0 -2.0  1.0  1.0
B 1 4  0.0  0.0 -1.0 -0.0
  2 5  0.0  0.0 -2.0  1.0
  3 6  0.0  1.0 -0.0 -1.0
C 1 7 -1.0 -0.0  1.0 -0.0
  2 8  1.0 -0.0 -1.0  0.0
  3 9  0.0 -0.0 -1.0  2.0

In [136]:
df.loc['A'].loc[3][3]

3    1.0
Name: 3, dtype: float64

In [137]:
#########################################################

In [142]:
df=pd.DataFrame({'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]})
df['State']='Delhi UP Rajisthan'.split()
df.set_index('State',inplace=True)

In [143]:
df

             A    B  C
State
Delhi      1.0  5.0  1
UP         2.0  NaN  2
Rajisthan  NaN  NaN  3

In [144]:
df.dropna(axis=0)

         A    B  C
State
Delhi  1.0  5.0  1

In [145]:
df.dropna(axis=1)

           C
State
Delhi      1
UP         2
Rajisthan  3

In [146]:
#thresh Require that many non-NA values.
df.dropna(thresh=2,axis=1)

             A  C
State
Delhi      1.0  1
UP         2.0  2
Rajisthan  NaN  3

Fill NA operation

In [147]:
df

             A    B  C
State
Delhi      1.0  5.0  1
UP         2.0  NaN  2
Rajisthan  NaN  NaN  3

In [148]:
df.fillna(2)

             A    B  C
State
Delhi      1.0  5.0  1
UP         2.0  2.0  2
Rajisthan  2.0  2.0  3

In [151]:
df.fillna(value=df['A'].mean())

             A    B  C
State
Delhi      1.0  5.0  1
UP         2.0  1.5  2
Rajisthan  1.5  1.5  3

In [154]:
# Create dataframe
data={
    'Company':['GOOG','GOOG','MSTF','MSTF','FB','FB'],
    'Person':['aman','rohan','sonakshi','toni','pretti','payal'],
    'Sale':[1000,2000,3000,4000,5000,6000]

}

df=pd.DataFrame(data)
df

  Company    Person  Sale
0    GOOG      aman  1000
1    GOOG     rohan  2000
2    MSTF  sonakshi  3000
3    MSTF      toni  4000
4      FB    pretti  5000
5      FB     payal  6000

In [155]:
df.groupby('Company')

In [156]:
byComp=df.groupby('Company')
byComp.mean()

         Sale
Company
FB       5500
GOOG     1500
MSTF     3500

In [157]:
df.groupby('Company').mean()

         Sale
Company
FB       5500
GOOG     1500
MSTF     3500

In [158]:
df.groupby('Company').sum()

          Sale
Company
FB       11000
GOOG      3000
MSTF      7000

In [159]:
df.groupby('Company').max()

         Person  Sale
Company
FB       pretti  6000
GOOG      rohan  2000
MSTF       toni  4000

In [162]:
df1=df.groupby('Company').describe()
df1

         Sale
        count    mean         std     min     25%     50%     75%     max
Company
FB        2.0  5500.0  707.106781  5000.0  5250.0  5500.0  5750.0  6000.0
GOOG      2.0  1500.0  707.106781  1000.0  1250.0  1500.0  1750.0  2000.0
MSTF      2.0  3500.0  707.106781  3000.0  3250.0  3500.0  3750.0  4000.0

In [167]:
df1.loc[['GOOG','MSTF'],'Sale'][['std','min']]

                std     min
Company
GOOG     707.106781  1000.0
MSTF     707.106781  3000.0

In [170]:
df.groupby('Company').describe().loc[['GOOG','MSTF'],'Sale'][['std','min']]

                std     min
Company
GOOG     707.106781  1000.0
MSTF     707.106781  3000.0

In [174]:
df2=df1.T
df2

Company              FB         GOOG         MSTF
Sale count     2.000000     2.000000     2.000000
     mean   5500.000000  1500.000000  3500.000000
     std     707.106781   707.106781   707.106781
     min    5000.000000  1000.000000  3000.000000
     25%    5250.000000  1250.000000  3250.000000
     50%    5500.000000  1500.000000  3500.000000
     75%    5750.000000  1750.000000  3750.000000
     max    6000.000000  2000.000000  4000.000000

In [176]:
df2.loc['Sale'].loc[['std','min'],['FB','GOOG']]

Company           FB         GOOG
std       707.106781   707.106781
min      5000.000000  1000.000000

In [177]:
# Requirment is to find the standard deviation of  GOOG

df2.loc['Sale'].loc['std','GOOG']

707.1067811865476

In [182]:
df.groupby('Company').describe().loc['GOOG','Sale']['std']

707.1067811865476

In [183]:
###### Practice #############

In [185]:
City_1 = [1,2,3,4]
City_2 = [2,3,4,5]

#Union
set(City_1).union(City_2)

{1, 2, 3, 4, 5}

In [186]:
City_1+City_2 # Union All

[1, 2, 3, 4, 2, 3, 4, 5]

In [192]:
# want the element from city1 where city2 is not there

set(City_1).difference(City_2)

{1}

In [195]:
data=pd.DataFrame(data={'ID':[2190,6414,'AAVF',2368,5637,5533,1168,5747,6869,'DLGD']})

In [196]:
data

     ID
0  2190
1  6414
2  AAVF
3  2368
4  5637
5  5533
6  1168
7  5747
8  6869
9  DLGD

In [210]:
index=[]
for i in data['ID'].index:
    if type(data.iloc[i])==int:
        index.append(i)

In [211]:
index

[]

In [212]:
type(data.iloc[0])

pandas.core.series.Series

In [215]:
ID=[2190,6414,'AAVF',2368,5637,5533,1168,5747,6869,'DLGD']

In [221]:
index=[]
for i in ID:
    if type(i)==int:
        index.append(ID.index(i))

In [222]:
index

[0, 1, 3, 4, 5, 6, 7, 8]

In [228]:
list(data['ID'].index)

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

In [227]:
for i in data['ID'].index:
    print(i)

0
1
2
3
4
5
6
7
8
9

In [230]:
type(data['ID'].iloc[0])

int

In [231]:
ii=[]

for i in data['ID'].index:
    if type(data['ID'].iloc[i])==int:
        ii.append(i)

In [232]:
ii

[0, 1, 3, 4, 5, 6, 7, 8]

In [233]:
[i for i in data['ID'].index if type(data['ID'].iloc[i])==int]

[0, 1, 3, 4, 5, 6, 7, 8]

In [235]:
x=lambda x:x*10

x(2)

20

In [240]:
listofNum = [1,3,33,12,34,56,11,19,21,34,15]

In [243]:
list(filter(lambda x : x>10 and x<20,listofNum))

[12, 11, 19, 15]

In [246]:
fuk=lambda x :x*10 if x<10 else(x*3 if x>10 and x<20 else x)

fuk(90)

90

In [247]:
data['ID']

0    2190
1    6414
2    AAVF
3    2368
4    5637
5    5533
6    1168
7    5747
8    6869
9    DLGD
Name: ID, dtype: object

In [248]:
[i for i in data['ID'].index if type(data['ID'].iloc[i])==int]

[0, 1, 3, 4, 5, 6, 7, 8]

In [ ]:
partrating	numReviews	
A308	100	7	
A308	98	89

In [250]:
dt={
'part':['A308','A308'],
'rating':[100,98],
'NumReviews':[7,8]
}

data=pd.DataFrame(dt)
data

   part  rating  NumReviews
0  A308     100           7
1  A308      98           8

In [274]:
dd=data.groupby('part').describe()
dd

     rating                                                NumReviews       \
      count  mean       std   min   25%   50%   75%    max      count mean
part
A308    2.0  99.0  1.414214  98.0  98.5  99.0  99.5  100.0        2.0  7.5


           std  min   25%  50%   75%  max
part
A308  0.707107  7.0  7.25  7.5  7.75  8.0

In [308]:
data.groupby('part').agg({'rating':'max'})

      rating
part
A308     100

In [309]:
data.groupby('part').agg({'NumReviews':'sum'})

      NumReviews
part
A308          15

In [310]:
pd.concat([data.groupby('part').agg({'NumReviews':'sum'}),data.groupby('part').agg({'rating':'max'})],axis=1)

      NumReviews  rating
part
A308          15     100

#### Concatination of two DataFrame

In [280]:
# Creating DataFrame

df1=pd.DataFrame({'A':['A0','A1','A2','A3'],
                 'B':['B0','B1','B2','B3'],
                 'C':['C0','C1','C2','C3'],
                 'D':['D0','D1','D2','D3']},index=[0,1,2,3])
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [283]:
df2=pd.DataFrame({'A':['A4','A5','A6','A7'],
                 'B':['B4','B5','B6','B7'],
                 'C':['C4','C5','C6','C7'],
                 'D':['D4','D5','D6','D7']},index=[4,5,6,7])
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [284]:
df3=pd.DataFrame({'A':['A8','A9','A10','A11'],
                 'B':['B8','B9','B10','B11'],
                 'C':['C8','C9','C10','C11'],
                 'D':['D8','D9','D10','D11']},index=[8,9,10,11])
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [290]:
# Vertical Concatination
df_catV=pd.concat([df1,df2,df3],axis=0)
print(df_catV)

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [293]:
df_catV.loc[2]

A    A2
B    B2
C    C2
D    D2
Name: 2, dtype: object

In [295]:
# Horizantal concatination
df_catH=pd.concat([df1,df2,df3],axis=1)
df_catH

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [297]:
df_catH.iloc[8:12,5:11]

      B    C    D    A    B    C
8   NaN  NaN  NaN   A8   B8   C8
9   NaN  NaN  NaN   A9   B9   C9
10  NaN  NaN  NaN  A10  B10  C10
11  NaN  NaN  NaN  A11  B11  C11

### Merging of DataFrame

In [316]:
left=pd.DataFrame(data={'key':['k0','k1','k2','k3'],
                        'A':['A0','A1','A2','A3'],
                        'B':['B0','B1','B2','B3']})
right=pd.DataFrame(data={'key':['k0','k8','k2','k3'],
                         'C':['C0','C1','C2','C3'],
                         'D':['D0','D1','D2','D3']})

In [317]:
left

  key   A   B
0  k0  A0  B0
1  k1  A1  B1
2  k2  A2  B2
3  k3  A3  B3

In [318]:
right

  key   C   D
0  k0  C0  D0
1  k8  C1  D1
2  k2  C2  D2
3  k3  C3  D3

In [319]:
#inner join

merge1=pd.merge(left,right,how='inner',on='key')
merge1

  key   A   B   C   D
0  k0  A0  B0  C0  D0
1  k2  A2  B2  C2  D2
2  k3  A3  B3  C3  D3

In [320]:
#
df1=pd.DataFrame(data={'key1':['k0','k1','k2','k3'],
                        'A':['A0','A1','A2','A3'],
                        'B':['B0','B1','B2','B3']})
df2=pd.DataFrame(data={'key2':['k0','k8','k2','k3'],
                         'C':['C0','C1','C2','C3'],
                         'D':['D0','D1','D2','D3']})

In [323]:
df1

  key1   A   B
0   k0  A0  B0
1   k1  A1  B1
2   k2  A2  B2
3   k3  A3  B3

In [324]:
df2

  key2   C   D
0   k0  C0  D0
1   k8  C1  D1
2   k2  C2  D2
3   k3  C3  D3

In [325]:
pd.merge(df1,df2,left_on='key1',right_on='key2',how='inner')

  key1   A   B key2   C   D
0   k0  A0  B0   k0  C0  D0
1   k2  A2  B2   k2  C2  D2
2   k3  A3  B3   k3  C3  D3

In [326]:
# left join

pd.merge(df1,df2,left_on='key1',right_on='key2',how='left')

  key1   A   B key2    C    D
0   k0  A0  B0   k0   C0   D0
1   k1  A1  B1  NaN  NaN  NaN
2   k2  A2  B2   k2   C2   D2
3   k3  A3  B3   k3   C3   D3

In [327]:
# Right Join
pd.merge(df1,df2,left_on='key1',right_on='key2',how='right')

  key1    A    B key2   C   D
0   k0   A0   B0   k0  C0  D0
1   k2   A2   B2   k2  C2  D2
2   k3   A3   B3   k3  C3  D3
3  NaN  NaN  NaN   k8  C1  D1

In [328]:
# Full outer join

pd.merge(df1,df2,left_on='key1',right_on='key2',how='outer')

  key1    A    B key2    C    D
0   k0   A0   B0   k0   C0   D0
1   k1   A1   B1  NaN  NaN  NaN
2   k2   A2   B2   k2   C2   D2
3   k3   A3   B3   k3   C3   D3
4  NaN  NaN  NaN   k8   C1   D1

### JOin

In [340]:
left=pd.DataFrame(data={'key':['k0','k1','k2','k3'],
                        'A':['A0','A1','A2','A3'],
                        'B':['B0','B1','B2','B3']})
right=pd.DataFrame(data={'key':['k0','k8','k2','k3'],
                         'C':['C0','C1','C2','C3'],
                         'D':['D0','D1','D2','D3']})

left.set_index('key',inplace=True)
right.set_index('key',inplace=True)

In [342]:
left

      A   B
key
k0   A0  B0
k1   A1  B1
k2   A2  B2
k3   A3  B3

In [343]:
right

      C   D
key
k0   C0  D0
k8   C1  D1
k2   C2  D2
k3   C3  D3

In [345]:
left.join(right,how='left')

      A   B    C    D
key
k0   A0  B0   C0   D0
k1   A1  B1  NaN  NaN
k2   A2  B2   C2   D2
k3   A3  B3   C3   D3

In [346]:
# Basic difference between merge and join is merge work on column index whereas join work on row indexs.

In [352]:
dd1=pd.DataFrame({'key1':['k0','k1','k2','k3'],
                  'A':['A0','A1','A2','A3'],
                  'B':['B0','B1','B2','B3'],
                  'C':['C0','C1','C2','C3']})
dd1

  key1   A   B   C
0   k0  A0  B0  C0
1   k1  A1  B1  C1
2   k2  A2  B2  C2
3   k3  A3  B3  C3

In [348]:
dd2=pd.DataFrame({'key2':['k0','k1','k2','k3'],
                  'B':['B0','B1','B2','B3'],
                  'C':['C0','C1','C2','C3'],
                  'D':['D0','D1','D2','D3']})
dd2

  key2   B   C   D
0   k0  B0  C0  D0
1   k1  B1  C1  D1
2   k2  B2  C2  D2
3   k3  B3  C3  D3

In [350]:
dd3=pd.DataFrame({'key3':['k0','k1','k2','k3'],
                  'A':['A0','A1','A2','A3'],
                  'B':['B0','B1','B2','B3'],
                  'D':['D0','D1','D2','D3']})
dd3

  key3   A   B   D
0   k0  A0  B0  D0
1   k1  A1  B1  D1
2   k2  A2  B2  D2
3   k3  A3  B3  D3

In [353]:
pd.concat([dd1,dd2,dd3],axis=1)

  key1   A   B   C key2   B   C   D key3   A   B   D
0   k0  A0  B0  C0   k0  B0  C0  D0   k0  A0  B0  D0
1   k1  A1  B1  C1   k1  B1  C1  D1   k1  A1  B1  D1
2   k2  A2  B2  C2   k2  B2  C2  D2   k2  A2  B2  D2
3   k3  A3  B3  C3   k3  B3  C3  D3   k3  A3  B3  D3

In [354]:
pd.concat([dd1,dd2,dd3],axis=0)

  key1    A   B    C key2    D key3
0   k0   A0  B0   C0  NaN  NaN  NaN
1   k1   A1  B1   C1  NaN  NaN  NaN
2   k2   A2  B2   C2  NaN  NaN  NaN
3   k3   A3  B3   C3  NaN  NaN  NaN
0  NaN  NaN  B0   C0   k0   D0  NaN
1  NaN  NaN  B1   C1   k1   D1  NaN
2  NaN  NaN  B2   C2   k2   D2  NaN
3  NaN  NaN  B3   C3   k3   D3  NaN
0  NaN   A0  B0  NaN  NaN   D0   k0
1  NaN   A1  B1  NaN  NaN   D1   k1
2  NaN   A2  B2  NaN  NaN   D2   k2
3  NaN   A3  B3  NaN  NaN   D3   k3

In [355]:
pd.merge(dd1,dd2,left_on='key1',right_on='key2',how='outer')

  key1   A B_x C_x key2 B_y C_y   D
0   k0  A0  B0  C0   k0  B0  C0  D0
1   k1  A1  B1  C1   k1  B1  C1  D1
2   k2  A2  B2  C2   k2  B2  C2  D2
3   k3  A3  B3  C3   k3  B3  C3  D3

In [361]:
## Apply function

In [374]:
df=pd.DataFrame({'col1':list(range(1,5)),
                 'col2':list(range(501,505)),
                 'col3':'aaa bbb ccc ddd'.split()})
df

   col1  col2 col3
0     1   501  aaa
1     2   502  bbb
2     3   503  ccc
3     4   504  ddd

In [375]:
# Suppose my requirment is to create new column through log of col1.I can do with the help of apply method.

In [381]:
df['applied']=df['col1'].apply(lambda x: np.log10(x))

In [382]:
df

   col1  col2 col3   applied
0     1   501  aaa  0.000000
1     2   502  bbb  0.301030
2     3   503  ccc  0.477121
3     4   504  ddd  0.602060

In [383]:
# Now suppose my requirment is if there is any value in col2 which is greater than 503 then return the log else divide it by 10.

In [384]:
def check_num(x):
    if x >503:
        return (10*np.log10(x))
    else:
        return (x/10)

In [386]:
df['new_apply']=df['col2'].apply(check_num)

In [387]:
df

   col1  col2 col3   applied  new_apply
0     1   501  aaa  0.000000  50.100000
1     2   502  bbb  0.301030  50.200000
2     3   503  ccc  0.477121  50.300000
3     4   504  ddd  0.602060  27.024305

In [388]:
# Suppose i want to find out length of every string

df['len_col3']=df['col3'].apply(lambda x: len(x))
df

   col1  col2 col3   applied  new_apply  len_col3
0     1   501  aaa  0.000000  50.100000         3
1     2   502  bbb  0.301030  50.200000         3
2     3   503  ccc  0.477121  50.300000         3
3     4   504  ddd  0.602060  27.024305         3

In [389]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [392]:
#Sorting value

df.sort_values('col2',ascending=False)

   col1  col2 col3   applied  new_apply  len_col3
3     4   504  ddd  0.602060  27.024305         3
2     3   503  ccc  0.477121  50.300000         3
1     2   502  bbb  0.301030  50.200000         3
0     1   501  aaa  0.000000  50.100000         3

In [393]:
df.describe()

           col1        col2   applied  new_apply  len_col3
count  4.000000    4.000000  4.000000   4.000000       4.0
mean   2.500000  502.500000  0.345053  44.406076       3.0
std    1.290994    1.290994  0.261084  11.588135       0.0
min    1.000000  501.000000  0.000000  27.024305       3.0
25%    1.750000  501.750000  0.225772  44.331076       3.0
50%    2.500000  502.500000  0.389076  50.150000       3.0
75%    3.250000  503.250000  0.508356  50.225000       3.0
max    4.000000  504.000000  0.602060  50.300000       3.0